Autodesk.Revit.DB.ScheduleField.GetName
Gets the name of the field.
Returns:
The name of the field.
Since:
2013

Autodesk.Revit.DB.ScheduleField.GetSchedulableField
Gets a SchedulableField object representing this field.
Remarks:
A ScheduleableField cannot be obtained for:
- Calculated fields
- Combined parameters
Returns:
The SchedulableField object.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This ScheduleField is not a schedulable field by type(non-calculated/non-combined-parameter).
Since:
2013

Autodesk.Revit.DB.ScheduleField.SetFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions to optionally override the default settings in the Units class.
Remarks:
See the UnitType property to determine the unit type of this field.
formatOptions:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The display unit in formatOptions is not a valid display unit for the unit type of this ScheduleField, or the rounding method in formatOptions is not set to Nearest.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ScheduleField.GetFormatOptions
Gets the FormatOptions to optionally override the default settings in the Units class.
Returns:
A copy of the FormatOptions.
Since:
2014

Autodesk.Revit.DB.ScheduleField.ResetOverride
Resets the override of this field.
Since:
2014

Autodesk.Revit.DB.ScheduleField.SetStyle(Autodesk.Revit.DB.TableCellStyle)
Sets the style of this field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ScheduleField.GetStyle
Gets the style of this field.
Since:
2014

Autodesk.Revit.DB.ScheduleField.CanDisplayMinMax
Indicates if this field can display minimum and maximum values.
Returns:
True if this field can display minimum and maximum values, false otherwise.
Since:
2017

Autodesk.Revit.DB.ScheduleField.CanTotalByAssemblyType
Indicates if totals by assembly type can be enabled for this field.
Returns:
True if this field can be totaled by assembly type, false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleField.CanTotal
Indicates if totals can be enabled for this field.
Returns:
True if this field can be totaled, false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleField.CreatesCircularReferences(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field ID would create a circular chain of references
when used by the PercentageOf property of this field.
fieldId:
The field ID to check.
Returns:
True if the field ID would create a circular chain of references,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not InvalidScheduleFieldId or the ID of a field that can be
used to calculated percentages.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleField.SetCombinedParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Sets this field's combine parameter array if applicable
data:
data is array of TableCellCombinedParameterData to be set as combined parameters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.ScheduleField.GetCombinedParameters
Gets this field's combine parameter array if applicable
Returns:
Gets array of TableCellCombinedParameterData with the combined parameters data
Since:
2017

Autodesk.Revit.DB.ScheduleField.IsValidCombinedParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Checks if data is valid for combined parameters
data:
data is array of TableCellCombinedParameterData to be set as combined parameters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.ScheduleField.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ScheduleField.FieldIndex
The index of the field in the containing ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleField.FieldId
The ID of the field in the containing ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleField.Definition
The ScheduleDefinition that this field belongs to.
Since:
2013

Autodesk.Revit.DB.ScheduleField.Schedule
The schedule that this field belongs to.
Since:
2013

Autodesk.Revit.DB.ScheduleField.HasSchedulableField
Identifies if this ScheduleField object has access to a SchedulableField.
Calculated and combined parameter fields will not have the access.
Since:
2014

Autodesk.Revit.DB.ScheduleField.IsCombinedParameterField
Indicates if the field is a combined parameter field.
Since:
2017

Autodesk.Revit.DB.ScheduleField.IsCalculatedField
Indicates if the field is a calculated field (Formula or Percentage).
Since:
2014

Autodesk.Revit.DB.ScheduleField.UnitType
The unit type of this field, if applicable.
Since:
2014

Autodesk.Revit.DB.ScheduleField.GridColumnWidth
The width of the column in the editable grid view, measured in feet.
Remarks:
In a schedule with an embedded ScheduleDefinition, a column may
display two fields, one from each ScheduleDefinition.  In that case,
the larger of the two widths is used.
It is always aligned with the SheetColumnWidth.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: gridColumnWidth is negative.
Since:
2013

Autodesk.Revit.DB.ScheduleField.SheetColumnWidth
The width of the column on a sheet, measured in feet.
Remarks:
In a schedule with an embedded ScheduleDefinition, a column may
display two fields, one from each ScheduleDefinition.  In that case,
the larger of the two widths is used.
It is always aligned with the GridColumnWidth.
The width of the column.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: sheetColumnWidth is negative.
Since:
2013

Autodesk.Revit.DB.ScheduleField.IsOverridden
Indicates if the field is overridden or not.
Since:
2014

Autodesk.Revit.DB.ScheduleField.HeadingOrientation
The orientation of the column heading text.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleField.HorizontalAlignment
The horizontal alignment of text in the column.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleField.DisplayType
Indicates the chosen display type for the field.
Remarks:
This replaces the hasTotals property from 2017.
The hasTotals = true is same as DisplayType::Totals;
hasTotals = false is the same as DisplayType::Standard.
This also adds the ability to see Min/Max for grouped elements.
The display types are:
Standard - standard display type; will not display anything for multiple elements with different values.
Totals - In a non-itemized schedule,
totals are displayed in regular rows when multiple elements appear on the same row.
Min - In a non-itemized schedule,
minimum value is displayed in regular rows when multiple elements appear on the same row.
Max - In a non-itemized schedule,
maximum value is displayed in regular rows when multiple elements appear on the same row.
MinMax - In a non-itemized schedule,
Minimum/Maximum values are displayed in regular rows when multiple elements appear on the same row.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This ScheduleField cannot display minimum and maximum values.
-or-
When setting this property: This ScheduleField cannot be totaled.
Since:
2017

Autodesk.Revit.DB.ScheduleField.TotalByAssemblyType
In an assembly schedule view, indicates if totals are calculated for all
assembly instances of the same type or only for a single instance.
True if totals are calculated for all assembly instances.  False if totals
are calculated for one instance.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This ScheduleField cannot be totaled by assembly type.
-or-
When setting this property: Totals are not enabled for this ScheduleField.
Since:
2013

Autodesk.Revit.DB.ScheduleField.ColumnHeading
The column heading text.
Remarks:
On initial creation of a ScheduleField, the column heading is
initialized based on the field name (typically a parameter name).
The heading text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ScheduleField.IsHidden
Indicates if the field is hidden in the schedule.
Remarks:
A hidden field is not displayed in the schedule, but it can be used for
filtering, sorting, grouping, and conditional formatting and can be
referenced by Formula and Percentage fields.
True if the field is hidden, false otherwise.
Since:
2013

Autodesk.Revit.DB.ScheduleField.PercentageBy
The ID of the grouped schedule field used to calculate percentage totals.
Remarks:
A Percentage field calculates what percent of the total of another field
each element represents.  If PercentageBy is InvalidScheduleFieldId,
the total is of all elements in the schedule.  If PercentageBy is the
ID of one of the fields that the schedule is grouped by, the total is
of all elements in that group.
InvalidElementId or the ID of the grouped field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: percentageBy is not InvalidScheduleFieldId or the ID of a field that the
schedule is grouped by.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This ScheduleField is not a percentage field.
Since:
2013

Autodesk.Revit.DB.ScheduleField.PercentageOf
The ID of the field to calculate percentages of.
Remarks:
A Percentage field calculates what percent of the total of another field
each element represents.  PercentageOf is the ID of the field used to
calculate percentages.  If PercentageOf is InvalidScheduleFieldId,
no data is displayed.
Percentages can only be calculated for numeric fields.  The Count
field and other percentage fields cannot be used to calculate percentages.
The ID of the field, or InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: percentageOf is not InvalidScheduleFieldId or the ID of a field that can be
used to calculated percentages.
-or-
When setting this property: percentageOf would create a circular chain of references.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This ScheduleField is not a percentage field.
Since:
2013

Autodesk.Revit.DB.ScheduleField.ParameterId
The ID of the parameter displayed by the field.
Remarks:
Most field types require a parameter ID.  Count, Formula, and Percentage
fields don't have parameter IDs.
Since:
2013

Autodesk.Revit.DB.ScheduleField.FieldType
The type of data displayed by the field.
Since:
2013

Autodesk.Revit.DB.ScheduleField
A field in a schedule.
Remarks:
The ScheduleField class represents a single field in a ScheduleDefinition's
list of fields.  Each (non-hidden) field becomes a column in the schedule.
Most commonly, a field represents an instance or type parameter of
elements appearing in the schedule.  Some fields represent parameters
of other related elements, like the room that a scheduled element belongs to.
Fields can also represent data calculated from other fields in the schedule,
specifically Formula and Percentage fields.
Since:
2013